[
    {
        "id": 1,
        "title":"Lineaje raises $20M to help organizations combat software supply chain threats",
        "image":"https://techcrunch.com/wp-content/uploads/2023/07/GettyImages-1485193235.jpg",
        "category":"Security",
        "author":"Kyle Wiggers",
        "published_date":"July 30, 2024",
        "reading_time":"8 min read",
        "content":"The software supply chain faces threats from all sides. A 2024 report by the Ponemon Institute found that over half of organizations have experienced a software supply chain attack, with 54% having experienced one within the past year. Supply chain attacks typically target services from third-party vendors or open source software that make up a company’s tech stack, and they can financially devastate an organization. According to a Juniper Research study, supply chain cyberattacks could cost the global economy almost $81 billion in lost revenue and damages by 2026. The White House has indicated a commitment to addressing the broader issue of software supply chain security, openly declaring it a national security problem and releasing an executive order aimed at establishing mitigatory standards. The threat has fueled the demand for platforms that can be used to detect — and, in a perfect world, mitigate — attacks on a business’ software supply chain. One startup creating such a platform, Lineaje (a semi-phonetic spelling of “lineage”), today closed a $20 million Series A funding round. Founded in 2021 by Javed Hasan and Anand Revashetti, Lineaje develops tools to detect software in an organization’s supply chain that’s been tampered with, as well as outdated, potentially vulnerable open source software. Once Lineaje finds a likely vulnerability, it recommends fixes — if any are available — and warns against implementing those that might break the software. “For organizations that care about the risk their software creates for their organizations as well as their customers, focusing and managing this risk is critical,” Hasan, Lineaje’s CEO, told TechCrunch. “Lineaje was born to discover, manage and secure software irrespective of where it’s built.” Both Hasan and Revashetti hail from the cybersecurity industry, having worked at vendors including Symantec, McAfee and Norton. They crossed paths while at McAfee, where Revashetti was a fellow and chief architect. “Software supply chain attacks and concerns have been steadily increasing,” Hasan said. “As we looked at this space, it was clear that that supply chain was a top-three concern for CISOs and the U.S. government.” Lineaje occupies a crowded market. Kusari, Ox Security, Chainguard, Dustico and Endor are among its rivals, and big tech companies such as Google, Amazon and Microsoft are mounting efforts to improve general open source software security. But one way Lineaje is attempting to stand out is by embracing defense work. Hasan claims that the company has a contract with the U.S. Air Force to support its “Eagle Eyes” anti-terrorism program as well as relationships with other unnamed federal agencies. Public sector agencies certainly deal with software supply chain challenges similar to what the private sector sees. A recent report released by the U.S. Department of Homeland Security found that one U.S. government cabinet agency spent months responding to a vulnerability in the library of Apache’s Log4j2, a Java-based logging utility, in part because its security teams had trouble identifying where the vulnerable packages resided within their software environments. The proceeds from Lineaje’s Series A, which bring the startup’s total raised to $27 million, will bolster its efforts to acquire even more U.S. public sector clientele, Hasan continued. “The Series A funding round will cover us until early 2027 at least,” he said, adding that last year was Lineaje’s first year of revenue. “We have about 30 employees currently, with plans to double headcount by the end of the year.” The round was co-led by Prosperity7 Ventures, Neotribe and Hitachi with participation from Tenable Ventures, Carahsoft, Wipro Ventures, SecureOctane and AlumniVentures."
    },
    {
        "id": 2,
        "title":"Meta confirms launch of a bonus program for creators on Threads",
        "image":"https://techcrunch.com/wp-content/uploads/2024/02/Instagram-Threads-GettyImages-1795093602.jpeg?resize=1536,932",
        "category":"Media",
        "author":"Ivan Mehta",
        "published_date":"April 29, 2024",
        "reading_time":"5 min read",
        "content":"Meta’s Threads social network passed the 150 million monthly users mark recently, but the company is not slowing down its growth engine. To increase engagement, the social media giant is running a limited-time bonus program for Threads. Over the last few days, many accounts have posted about this program. The company confirmed to TechCrunch about a limited-time invite-only program for creators, which began testing in March. Meta said that invited creators will have “individualized” requirements for bonuses. At the moment, the program is limited to creators in the U.S. The company said it might expand the program to other regions if successful. On its support page, Meta says that invited creators must make a public Threads profile and follow the rules of Instagram creator incentive terms and rules for bonuses on Instagram. The company specified that the performance of Threads’ posts (views) and the number of posts are some of the parameters for creators to receive bonuses. There are also specific guidelines for what kind of posts would be eligible for the bonus program. For instance, one of the requirements states that a post must receive at least 2,500 views. Apart from that, Threads posts with copyrighted material, no text and boosted views won’t be eligible for bonuses. Meta adds that the content shouldn’t have a watermark of another platform such as TikTok or YouTube. Plus, the posted content shouldn’t be a brand partnership post. Creators can check their earnings on the professional dashboard and they might need to a earn minimum amount to receive a payout. “In some cases, you must earn a minimum amount to receive a bonus payout. If you don’t reach the minimum amount, you will not receive any bonus payout, but you may be invited to participate in another bonus opportunity in the future,” the company explains. This program might push Instagram users with substantial following to post more on Threads and, in turn, also port over some of their following. Instagram already shows suggested Threads on its app. Users might want to check out Meta’s rival X more frequently if their favorite creators are posting on the app. The new bonus program is also a good opportunity for creators who might want to build out an audience on the new platform. However, the monetary benefits might be temporary, as Meta hasn’t detailed long-term plans for creators to earn money on Threads."
    },
    {
        "id": 3,
        "title":"OpenAI says it’s taking a ‘deliberate approach’ to releasing tools that can detect writing from ChatGPT",
        "image":"https://techcrunch.com/wp-content/uploads/2024/05/openAI-spiral-color-v2.jpg",
        "category":"AI",
        "author":"Anthony Ha",
        "published_date":"August 4, 2024",
        "reading_time":"4 min read",
        "content":"OpenAI has built a tool that could potentially catch students who cheat by asking ChatGPT to write their assignments — but according to The Wall Street Journal, the company is debating whether to actually release it. In a statement provided to TechCrunch, an OpenAI spokesperson confirmed that the company is researching the text watermarking method described in the Journal’s story, but said it’s taking a “deliberate approach” due to “the complexities involved and its likely impact on the broader ecosystem beyond OpenAI.” “The text watermarking method we’re developing is technically promising, but has important risks we’re weighing while we research alternatives, including susceptibility to circumvention by bad actors and the potential to disproportionately impact groups like non-English speakers,” the spokesperson said. This would be a different approach from most previous efforts to detect AI-generated text, which have been largely ineffective. Even OpenAI itself shut down its previous AI text detector last year due to its “low rate of accuracy.” With text watermarking, OpenAI would focus solely on detecting writing from ChatGPT, not from other companies’ models. It would do so by making small changes to how ChatGPT selects words, essentially creating an invisible watermark in the writing that could later be detected by a separate tool. Following the publication of the Journal’s story, OpenAI also updated a May blog post about its research around detecting AI-generated content. The update says text watermarking has proven “highly accurate and even effective against localized tampering, such as paraphrasing,” but has proven “less robust against globalized tampering; like using translation systems, rewording with another generative model, or asking the model to insert a special character in between every word and then deleting that character.” As a result, OpenAI writes that this method is “trivial to circumvention by bad actors.” OpenAI’s update also echoes the spokesperson’s point about non-English speakers, writing that text watermarking could “stigmatize use of AI as a useful writing tool for non-native English speakers.”"
    },
    {
        "id": 4,
        "title":"Microsoft says 8.5M Windows devices were affected by CrowdStrike outage",
        "image":"https://techcrunch.com/wp-content/uploads/2024/07/GettyImages-2162660378.jpg?resize=1536,1024",
        "category":"Security",
        "author":"Anthony Ha",
        "published_date":"July 20, 2024",
        "reading_time":"2 min read",
        "content":"Around 8.5 million devices — less than 1 percent of Windows machines globally — were affected by the recent CrowdStrike outage, according to a Microsoft blog post by David Weston, the company’s vice president of enterprise and OS security. These are the first real numbers released by either Microsoft or CrowdStrike around the scale of yesterday’s outage, which was caused by an update to CrowdStrike’s cybersecurity software that led Windows machines to crash. (Mac and Linux devices were not affected.) Although the number of affected devices was relatively low, the havoc was widespread and global, affecting banks, retailers, brokerage companies, rail networks, and more. Airlines halted flight operations around the world. “While the percentage [of affected devices] was small, the broad economic and societal impacts reflect the use of CrowdStrike by enterprises that run many critical services,” Weston wrote. He did not say what percentage of Windows devices with CrowdStrike software were affected. It’s also worth noting that even if only one computer crashed, it could potentially take down an entire network or data center. Weston also wrote that “although this was not a Microsoft incident,” the company has been working with CrowdStrike to address the issue. Systems could be slow to recover if every affected computer requires a manual fix, but Weston said Microsoft and CrowdStrike have developed “a scalable solution that will help Microsoft’s Azure infrastructure accelerate a fix” and are also collaborating with Amazon Web Services and Google Cloud Platform."
    },
    {
        "id": 5,
        "title":"Meta puts a halt to training its generative AI tools in Brazil ",
        "image":"https://techcrunch.com/wp-content/uploads/2019/05/whatsapp-instagram.jpg?resize=1536,819",
        "category":"AI",
        "author":"Lauren Forristal",
        "published_date":"July 18, 2024",
        "reading_time":"1 min read",
        "content":"Meta has suspended the use of its AI assistant after Brazil’s National Data Protection Authority (ANPD) banned the company from training its AI models on personal data from Brazilians. The move puts a dent in Facebook’s attempt to build out its AI products in Brazil, a market with more than 200 million people. As cited in the official document, the Brazilian authority said that the preventive measure is due to “the imminent risk of serious harm and irreparable or difficult-to-repair damage to the fundamental rights of guardians.” Additionally, the ANPD set a daily fine of 50,000 reais in case of non-compliance. A Meta spokesperson confirmed the decision in a statement to TechCrunch, saying, “We decided to suspend genAI features that were previously live in Brazil while we engage with the ANPD to address their questions around genAI.” Meta has already been training its AI using user-generated content in the U.S. and other markets for several years. But in May, Meta had to pause plans to train its AI models in Europe and the U.K. after the Irish Data Protection Commission pushed back against these plans."
    },
    {
        "id": 6,
        "title":"Instagram now allows users to add multiple audio tracks to Reels",
        "image":"https://techcrunch.com/wp-content/uploads/2024/07/Instagram-Multi-Track-Audio-e1721193212204.jpg?resize=1536,862",
        "category":"Media",
        "author":"Ivan Mehta",
        "published_date":"July 16, 2024",
        "reading_time":"2 min read",
        "content":"Instagram just announced that it will allow users to add multiple audio tracks to their Reels worldwide. The company noted that users can add up to 20 tracks in a single Reel. To add a new track to your video, tap on the “Add to mix” option in the Reel editor. Once you add the tracks, you can trim them to include only the portion of audio you want. “The launch of multitrack audio in Reels gives creators expanded creative flexibility with the ability to visually align audio with elements like text, stickers, and clips to express their creativity in a way that feels right for them and their audience,” the company said in a post. Instagram will attribute the overall combined track to the creator so they can urge their fans to reuse the unique mix. This feature removes the need for creators to use another editor to mix multiple tracks into one and then apply it to their clips. Earlier this month, Instagram head Adam Mosseri said that the platform won’t concentrate on long-form videos and rather will concentrate on users sending each other short videos. “It turns out the long-form video is less symbiotic with these other jobs. If you watch a 10- or 20-minute video, you see less content from friends, you interact with your friends less and you’re actually less likely to send that content or that video to a friend,” Mosseri said in an Instagram Reel. “So we’re not going to go after that business because it’s part of our core identity to connect people with friends, and we don’t want to undermine that by going after long-form video. We understand short-form video doesn’t always do that, but it can.”"
    },
    {
        "id": 7,
        "title":"Kaspersky to shut down US operations, lay off employees after US government ban",
        "image":"https://techcrunch.com/wp-content/uploads/2024/06/kaspersky-logo-moscow.jpg?resize=1536,1024",
        "category":"Security",
        "author":"Zack Whittaker",
        "published_date":"July 16, 2024",
        "reading_time":"7 min read",
        "content":"Russian cybersecurity giant Kaspersky will lay off dozens of staff and leave the U.S. market following a U.S. government order in June banning the sale of the company’s software, citing security risks. Kaspersky said it will “gradually wind down” its U.S. operations beginning July 20, when the ban comes into effect, adding that its U.S. business is “no longer viable.” Independent journalist Kim Zetter first broke the news on Monday of the company shutting down its stateside business. Zetter said the number of employees affected by the layoffs is “less than 50” in the United States. Kaspersky spokesperson Sawyer VanHorn confirmed the company’s statement and layoffs to TechCrunch in an email Tuesday. The spokesperson was also part of the layoffs, said VanHorn. Kaspersky initially planned to challenge the ban, saying at the time the ban was announced that it “does not engage in activities which threaten U.S. national security,” and that it would “pursue all legally available options to preserve its current operations and relationships.” In June, the U.S. Commerce Department announced the “first of its kind” ban on the sale of Kaspersky’s antivirus software to U.S. consumers, citing increased security and privacy risks because the company is headquartered in Russia. “Russia has shown it has the capacity, and even more than that, the intent to exploit Russian companies like Kaspersky to collect and weaponize the personal information of Americans,” U.S. Commerce Secretary, Gina Raimondo, said in a call with reporters at the time. Once the ban comes into effect, Kaspersky will no longer be allowed to sell its software to U.S. consumers directly or through U.S.-based resellers of Kaspersky software, some of whom have criticized the ban for affecting their businesses. After September 29, Kaspersky will no longer be allowed to push software or security updates to U.S. customers. That will result in degraded protection from the antivirus software. The Commerce Department said it took a staggered approach to the ban to allow U.S. consumers to find an alternative to Kaspersky software. The U.S. Treasury also sanctioned several senior Kaspersky executives, effectively barring U.S. customers from paying Kaspersky for its software or transacting with any future company run by its executives. Chief executive Eugene Kaspersky was not sanctioned, the Treasury said. The U.S. government has acted against Kaspersky during both the Trump and Biden administrations. In 2017, the Trump administration banned the use of Kaspersky software across the federal government after Russian government hackers earlier that year stole U.S. classified documents from an intelligence contractor’s home computer, which was running Kaspersky software at the time. By their nature, antivirus products typically have broad, if not complete, access to the devices they are installed on to identify malicious cyber threats. When seen by TechCrunch on Tuesday, Kaspersky’s products were unavailable for purchase on its U.S. website. “For legal compliance purposes, Kaspersky products cannot be purchased from your country,” its website reads."
    }
]